import React from 'react';
import {ScrollView, Text} from 'react-native';
import {PactStyles as styles} from '@/style';

export default function Community() {
  return (
    <ScrollView style={styles.area}>
      <Text style={styles.title}>甜虾社区信息发布规范</Text>
      <Text>
        一、禁止发布类
        （一）枪支弹药、危险武器、军警及行政机关用品类：如枪支及其配件、军火、管制器具（如管制刀具、弩、飞镖等杀伤性冷兵器）、军警标志/服装/器具、行政机关的标志/制服/专用工具等；
        （二）易燃易爆、危险化学品、毒品类：如炸弹、火药、毒品、制毒原料/化学品、致瘾性药物、吸毒工具/配件/相关教程、烟花爆竹、腐蚀性/易燃易爆/有毒类化学品等。
        （三）危害国家安全、破坏政治与社会稳定的有害信息类：如分裂/破坏国家统一、泄露国家机密、宣扬反动/邪教、损害国家名誉等。
        （四）色情低俗、催情用品类：如含色情淫秽内容的音像/视频/游戏/软件/图文等、色情网站相关、色情低俗服务、原味、催情类用品等；
        （五）涉及人身隐私、安全类：如禁止出售的航空器、车辆及“五大总成”、破坏行驶安全的配件（如安全带插扣）、侵犯个人隐私类的数据/服务/软件/设备等（如监听/窃取隐私或机密的软件及设备、身份证件、个人隐私信息、企业内部敏感信息、盗取/破解账号密码的软件/工具等、群发设备/软件/服务等）、辱骂/恶意中伤/人身攻击的信息等。
        （六）药品、医疗器械、食品类：如药品、医疗器械、美容针剂、农药、兽药、须具备经营资质方可发布的食品（含婴幼儿食品、奶粉、酒类等）。
        （七）非法服务、票证、违反公序良俗类：如须特定资质/机构方可提供产品或服务（如代办社会公共服务/行政管理事务、募捐类、军需、特供商品、境外出版物及代购服务等），发布作弊/虚假商品或信息（如假章、假证、假发票、学术/考试作弊、代接电话、代体检、代炒作、代投票等）、规避出入境流程的商品及服务、赌博、翻墙软件、迷信、违反公序良俗的商品等。
        （八）动植物、器官及捕杀工具类：如人口买卖、人体器官（含卵子、精子等）、保护动植物、动物捕杀工具（含配件）、猫狗肉/皮毛、鱼翅、熊胆及其制品等。
        （九）涉及盗取等非法所得及非法用途软件、工具或设备类:
        如非法渠道物资、偷盗工具、作弊/造假工具（如电子秤、指纹膜、虚假定位、游戏外挂等）、群发设备/服务、蹭网设备/服务、信号屏蔽设备、涉嫌欺诈工具/服务、规避交通管理工具/服务等；
        （十）假冒商品、不当使用他人权利的商品或信息类：如假冒注册商标、盗版、侵犯他人商标权/著作权/专利权等的商品或信息；
        （十一）未经允许违反国家行政法规或不适合交易的商品或信息类：如流通中的货币及兑换服务、电子货币及衍生服务、假币及印刷设备、手机卡/上网卡、文物、烟草、禁止或限制进出口的商品或服务等、如未经国家备案/官方已停运的游戏相关、棋牌类游戏点卡、外挂/私服相关的网游商品、互联网用户账号、SP业务自消费类、航空公司积分/里程及兑换的机票、机票代订、网络游戏代练、充值平台软件/加款卡、不可查询的虚拟服务商品等。
        （十二）其他违反法规或平台要求的高风险类：如非法传销、不合格商品、禁止发行及停售的出版物、实际不存在商品、干扰公平秩序的软件/服务、制假风险的品牌配件（如品牌空瓶、空酒瓶、空奶粉罐等）、引导站外、垃圾无效广告、虚假夸大宣传存在误导、信息要素不一致、借用话题/内容炒作引导等。
        二、按要求发布类：
        甜虾用户在甜虾社区发布的信息不得违反国家相关法律法规及甜虾社区的相关要求，若甜虾主动发现或经用户举报等方式核实用户存在违反本规范的行为的，甜虾可根据用户违规的具体情况及严重程度采取包括下架/删除/屏蔽/降权违规信息、限制发布商品、限制互动（如留言、评论、点赞、聊天、问答、个人主页等）、限制交易、限制加入鱼塘、限制成为鱼塘塘主、限制参加营销活动、违规扣分甚至查封账户等处置措施，同时，针对情节严重的，甜虾将建立违规公示名单，在社区内公开披露相关违法违规情形，涉嫌违法违规的，甜虾也将配合移送相关国家机关处理。
        （一）出版物类商品：
        出版物是指图书、报纸、期刊、音像制品、地图、挂历、电子出版物等。
        二级类目“图书”商品须扫码（ISBN）发布，该类目在线商品数不得超过5件，且近30天图书类交易笔数不得超过15笔；
        发布的单一闲置物品信息中不得含有多件出版物类物品信息（套装出版物除外）。
        （二）票务类商品：
        二级类目“演艺/表演类门票”的在线商品数不得超过3件，单张门票的售卖价格不得超过票面价格的10%，且近90天演艺/表演类门票交易笔数不得超过3笔。
        （三）电子卡券类商品：
        电子卡券是指话费充值卡、加油卡、电商/商超卡、游戏卡、视频娱乐卡、咖啡美食卡券、旅游出行卡券等电子形式的卡券。
        甜虾合作回收商向用户回收电子卡券类商品，每笔回收订单最多5张卡券（其中二维码形式的咖啡美食券最多10张），每种类型卡券的交易金额不得超过5000元/天。
        本规范中已有规定的从规范，本规范未有规定的依据《甜虾社区公约》、《甜虾管理规则》等相关规则执行。
      </Text>
      <Text style={styles.bottom}>甜虾社区 3月22日</Text>
    </ScrollView>
  );
}
